In [1]:
import pandas as pd 
import re
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv(r"C:\Users\DELL\Desktop\clean_jobs.csv")

In [3]:
df[df['title']=='data associate - gurgaon']

Empty DataFrame
Columns: [id, title, company, location, link, source, date_posted, work_type, employment_type, description]
Index: []

In [4]:
# get first 5 rows 
df.head()

,id,title,company,location,link,source,date_posted,work_type,employment_type,description
0,1,Data Analyst,Meta,"New York, NY",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
1,2,Data Analyst,Meta,"San Francisco, CA",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
2,3,Data Analyst,Meta,"Los Angeles, CA",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
3,4,Data Analyst,Meta,"Washington, DC",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-14,NaN,NaN,The Social Measurement team is a growing team ...
4,5,Data Analyst II,Pinterest,"Chicago, IL",https://www.linkedin.com/jobs/view/data-analys...,LinkedIn,2025-04-16,NaN,NaN,About Pinterest\n\nMillions of people around t...

In [5]:
# get last 5 rows 
df.tail()

,id,title,company,location,link,source,date_posted,work_type,employment_type,description
322,691,Data Engineer- Python Pyspark,Virtusa,"Chennai, Tamil Nadu, India",https://in.linkedin.com/jobs/view/data-enginee...,LinkedIn,2025-04-10,NaN,NaN,Senior Data Engineer\n\nPosition Summary\n\nTh...
323,692,Data Engineer with Pyspark,Cognizant,"Bangalore Urban, Karnataka, India",https://in.linkedin.com/jobs/view/data-enginee...,LinkedIn,2025-04-13,NaN,NaN,Job Title:- Data Engineer with Pyspark\n\nLoca...
324,693,Data Engineer,Mercedes-Benz Malaysia,"Puchong, Selangor, Malaysia",https://my.linkedin.com/jobs/view/data-enginee...,LinkedIn,2025-04-16,NaN,NaN,"About Us\n\n\n\n\nAt Mercedes-Benz, we don’t j..."
325,740,Data Engineer I,IntePros,"Seattle, WA",https://www.linkedin.com/jobs/view/data-engine...,LinkedIn,2025-04-15,NaN,NaN,Data Engineer I – Infrastructure & Automation ...
326,741,Data Engineer,Snap Inc.,"Bellevue, WA",https://www.linkedin.com/jobs/view/data-engine...,LinkedIn,2025-04-16,NaN,NaN,Snap Inc is a technology company. We believe t...

In [6]:
# get some information about our dataset like number of rows in each columns, null and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 327 entries, 0 to 326
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               327 non-null    int64
 1   title            327 non-null    object
 2   company          327 non-null    object
 3   location         327 non-null    object
 4   link             327 non-null    object
 5   source           327 non-null    object
 6   date_posted      327 non-null    object
 7   work_type        0 non-null      float64
 8   employment_type  0 non-null      float64
 9   description      327 non-null    object
dtypes: float64(2), int64(1), object(7)
memory usage: 25.7+ KB

In [7]:
# get num of columns , num of Rows
df.shape

(327, 10)

In [8]:
# get columns 
df.columns

Index(['id', 'title', 'company', 'location', 'link', 'source', 'date_posted',
       'work_type', 'employment_type', 'description'],
      dtype='object')

In [9]:
# check if there is null value
df.isna().sum()

id                   0
title                0
company              0
location             0
link                 0
source               0
date_posted          0
work_type          327
employment_type    327
description          0
dtype: int64

In [10]:
# make the data in a lowercase form
df = df.applymap(lambda x: x.lower() if isinstance(x, str) else x)

In [11]:
# see the changes 
df.head()

,id,title,company,location,link,source,date_posted,work_type,employment_type,description
0,1,data analyst,meta,"new york, ny",https://www.linkedin.com/jobs/view/data-analys...,linkedin,2025-04-14,NaN,NaN,the social measurement team is a growing team ...
1,2,data analyst,meta,"san francisco, ca",https://www.linkedin.com/jobs/view/data-analys...,linkedin,2025-04-14,NaN,NaN,the social measurement team is a growing team ...
2,3,data analyst,meta,"los angeles, ca",https://www.linkedin.com/jobs/view/data-analys...,linkedin,2025-04-14,NaN,NaN,the social measurement team is a growing team ...
3,4,data analyst,meta,"washington, dc",https://www.linkedin.com/jobs/view/data-analys...,linkedin,2025-04-14,NaN,NaN,the social measurement team is a growing team ...
4,5,data analyst ii,pinterest,"chicago, il",https://www.linkedin.com/jobs/view/data-analys...,linkedin,2025-04-16,NaN,NaN,about pinterest\n\nmillions of people around t...

In [12]:
# skills for data related jobs 
data_skills = [
    'python', 'sql', 'excel', 'power bi', 'tableau', 'r', 'numpy', 'pandas',
    'matplotlib', 'seaborn', 'machine learning', 'deep learning', 'tensorflow',
    'keras', 'scikit-learn', 'statistics', 'data analysis', 'data visualization',
    'etl', 'hadoop', 'spark', 'big data', 'data wrangling', 'dash', 'plotly','dash'
]

In [13]:
# function to extract the skills from the description 
def extract_skills(description):
    found_skills = [skill for skill in data_skills if re.search(r'\b' + re.escape(skill) + r'\b', description)]
    return ', '.join(found_skills) if found_skills else 'None'
# adding new column called skills 
df['skills'] = df['description'].apply(extract_skills)

In [14]:
# function to extract the work type from the description 
def extract_work_type(text):
    if pd.isna(text):
        return 'unknown'
    elif any(kw in text for kw in ['remote', 'work from home', 'fully remote']):
        return 'remote'
    elif any(kw in text for kw in ['onsite', 'on-site', 'office-based']):
        return 'onsite'
    elif any(kw in text for kw in ['hybrid', 'partially remote', '2 days in office']):
        return 'hybrid'
    else:
        return 'unknown'

In [15]:
# adding the work type to column work_type 
df['work_type'] = df['description'].apply(extract_work_type)

In [16]:
# function to extract the Minmum skills from the description 
def extract_min_experience(text):
    if pd.isna(text):
        return None

    # Regex pattern to find experience-related phrases
    pattern = r'(\d+)(?:\+|\-)?\s*(\d+)?\s*years?'

    matches = re.findall(pattern, text.lower())

    if matches:
        # Convert the first number in the match to integer (minimum years)
        min_years = [int(match[0]) for match in matches]
        return min(min_years)  # Use min in case there are multiple numbers
    return None

In [17]:
# adding columns for experience required 
df['experience'] = df['description'].apply(extract_min_experience)

In [18]:
# Convert to numeric 
df['experience'] = pd.to_numeric(df['experience'], errors='coerce')
# Make a threshold of 15 year of experience 
df = df[df['experience'] <= 15]
# fill null values with the min experience of 0 
df['experience'] = df['experience'].fillna(0)

In [19]:
# drop columns the irrelavent and doesn't add somthing new and doesn't contain any thing 
df.drop(['id','link','source', 'employment_type','description'], axis=1, inplace= True)

In [20]:
# get some information about our dataset like number of rows in each columns, null and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 228 entries, 0 to 326
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        228 non-null    object
 1   company      228 non-null    object
 2   location     228 non-null    object
 3   date_posted  228 non-null    object
 4   work_type    228 non-null    object
 5   skills       228 non-null    object
 6   experience   228 non-null    float64
dtypes: float64(1), object(6)
memory usage: 14.2+ KB

In [21]:
# check the duplicates 
df[['title','company','location']].duplicated().sum()

14

In [22]:
# get them 
df[df[['title','company','location']].duplicated()]

,title,company,location,date_posted,work_type,skills,experience
195,"data scientist, product analytics",meta,"new york, ny",2025-04-14,unknown,"python, sql, r, machine learning, statistics",4.0
196,"data scientist, product analytics",meta,"new york, ny",2025-04-14,unknown,"python, sql, r, machine learning, statistics",2.0
197,"data scientist, product analytics",meta,"san francisco, ca",2025-04-14,unknown,"python, sql, r, machine learning, statistics",4.0
198,"data scientist, product analytics",meta,"san francisco, ca",2025-04-14,unknown,"python, sql, r, machine learning, statistics",2.0
215,"data scientist, product analytics",meta,"washington, dc",2025-04-14,unknown,"python, sql, r, machine learning, statistics",2.0
252,"data engineer, product analytics",meta,"san francisco, ca",2025-04-14,unknown,"python, sql, machine learning, etl",2.0
255,"data engineer, product analytics",meta,"new york, ny",2025-04-14,unknown,"python, sql, machine learning, etl",4.0
263,"data engineer, product analytics",meta,"fremont, ca",2025-04-14,unknown,"python, sql, machine learning, etl",2.0
265,"data engineer, product analytics",meta,"new york, ny",2025-04-14,unknown,"python, sql, machine learning, etl",7.0
269,"data engineer, product analytics",meta,"san francisco, ca",2025-04-14,unknown,"python, sql, machine learning, etl",4.0
298,"data engineer i, scot - aim",amazon,"bengaluru, karnataka, india",2025-04-12,unknown,"python, sql, etl, hadoop, spark, big data",1.0
301,"infrastructure partner data engineer, youtube",google,"bengaluru, karnataka, india",2025-04-12,unknown,"python, power bi, tableau, machine learning, e...",3.0
303,"data engineer i, scot - aim",amazon,"bengaluru, karnataka, india",2025-04-12,unknown,"python, sql, etl, hadoop, spark, big data",1.0
305,"data engineer i, scot - aim",amazon,"bengaluru, karnataka, india",2025-04-12,unknown,"python, sql, etl, hadoop, spark, big data",1.0

In [23]:
# droping the duplicatees 
df = df.drop_duplicates(subset=['title', 'company', 'location'])

In [24]:
# check the duplicates 
df[['title','company','location']].duplicated().sum()

0

In [25]:
# Converting the datatype of the column date_post to datetime
df['date_posted'] = pd.to_datetime(df['date_posted'])

In [26]:
# check the nulls 
df.isna().sum()

title          0
company        0
location       0
date_posted    0
work_type      0
skills         0
experience     0
dtype: int64

In [27]:
# Knowing the unique values to replace them to the same job title 
df['title'].unique()

array(['data analyst', 'data analyst ii', 'data analyst - marketing',
       'data analyst, global partnerships & content',
       'senior data analyst', 'data products analyst, youtube',
       'customer relationship management analyst', 'analytics associate',
       'data analyst i', 'data & analytics, analyst',
       'people data analyst', 'customer insights analyst',
       'analyst, data science, rmbs', 'analyst', 'business data analyst',
       'junior data analyst', 'healthcare data analyst i - remote',
       'data analyst - 100% remote', 'sr. data analyst',
       'data analyst contractor', 'data platform analyst, subscriptions',
       'lead data analyst (power bi,sql)', 'data analytics',
       'analyst-data science', 'analyst, data science', 'sr data analyst',
       'data analyst (data visualization)', 'data associate - gurgaon',
       'data analyst - local to pittsburgh or cleveland',
       'jr. data & bi analyst', 'data scientist, product, sustainability',
       'data scientist, product analytics', 'fraud data scientist',
       'senior data scientist', 'data scientist',
       'machine learning engineer (l5) - content & media ml foundations',
       'data scientist - last mile', 'jr. data scientist',
       'data scientist, marketing science', 'ai/ml engineer',
       'staff data scientist, strategy & insights', 'data scientist i',
       'data scientist/analyst', 'gen ai/ml',
       'data scientist, fundamental sector data',
       'data scientist (business operations)',
       'junior artificial intelligence (ai) / machine learning (ml) engineer',
       'junior frontend developer', 'machine learning engineer',
       'product data scientist', 'research and development scientist',
       'data scientist (ai/ml)', 'machine learning engineer (junior)',
       'ai/ml developer', 'data scientist, consumer research & marketing',
       'data scientist, marketing', 'ai engineer',
       'data scientist iii, product, operations data science',
       'data scientist iii (commercial analytics)',
       'data engineer (l5) - conversation',
       'data engineer (l4) - security', 'data engineer',
       'data engineer, play data science and analytics',
       'data engineer, infrastructure',
       'analytics engineer (l4) - acquisition',
       'data engineer, product analytics',
       'data engineer i (full time) united states',
       'software engineer l4, machine learning platform (metaflow)',
       'senior data engineer', 'senior, data engineer',
       'data engineer - people analytics', 'data engineer, vx analytics',
       'sr. data engineer', 'data engineer iii',
       'data engineer, analytics (technical leadership)',
       'remote engineer, data, i', 'data engineer jr.',
       'data engineer, digital acceleration', '(usa) data engineer iii',
       'data engineer i, in-ads', 'data engineer - python',
       'data engineer with python + sql', 'data engineer, marketplace',
       'infrastructure partner data engineer',
       'data engineer i, scot - aim',
       'infrastructure partner data engineer, youtube',
       'data operation engineer i', 'data engineer(aws)',
       'associate data engineer', 'data engineer - c10',
       'data engineer - enterprise data operations analyst',
       'data engineer - c11',
       'python & sql data engineer_director_software engineering',
       'senior software engineer, systems infrastructure',
       'data engineer (platform)', 'data engineer- python pyspark',
       'data engineer with pyspark', 'data engineer i'], dtype=object)

In [28]:
# Replace full cell if it contains analysis-related words
df.loc[df['title'].str.contains(r'\b(analyst|analysis|analista|analytics|associate - gurgaon|intern)\b', regex=True), 'title'] = 'data analysis'

# Replace full cell if it contains (scientist or cientista)
df.loc[df['title'].str.contains(r'\b.*\b(scientist|cientista)\b', regex=True), 'title'] = 'data science'

# Replace full cell if it contains engineer or engineering
df.loc[df['title'].str.contains(r'\b.*\b(engineer|engineering)\b', regex=True), 'title'] = 'data engineering'

# Replace full cell if it contains machine + learning or ai/ml
df.loc[df['title'].str.contains(r'\bmachine\b.*\blearning\b|\b(ai|ml)\b', regex=True), 'title'] = 'machine learning & AI'

In [29]:
df.head(20)

,title,company,location,date_posted,work_type,skills,experience
0,data analysis,meta,"new york, ny",2025-04-14,unknown,"python, sql, tableau, r, machine learning, sta...",2.0
1,data analysis,meta,"san francisco, ca",2025-04-14,unknown,"python, sql, tableau, r, machine learning, sta...",2.0
2,data analysis,meta,"los angeles, ca",2025-04-14,unknown,"python, sql, tableau, r, machine learning, sta...",2.0
3,data analysis,meta,"washington, dc",2025-04-14,unknown,"python, sql, tableau, r, machine learning, sta...",2.0
4,data analysis,pinterest,"chicago, il",2025-04-16,unknown,"python, sql, statistics",4.0
5,data analysis,fanduel,"new york, ny",2025-04-11,hybrid,"python, sql, excel, tableau, data visualization",3.0
7,data analysis,fanduel,"new york, ny",2025-04-13,unknown,"python, sql, excel, tableau, r, data visualiza...",2.0
8,data analysis,sbh fashion,"new york, ny",2025-04-12,remote,"python, sql, excel, tableau, data analysis, da...",3.0
9,data analysis,pinterest,"new york, ny",2025-04-16,unknown,"python, sql, statistics",4.0
10,data analysis,pinterest,"san francisco, ca",2025-04-16,unknown,"python, sql, statistics",4.0
11,data analysis,meta,"new york, ny",2025-04-14,unknown,"sql, machine learning, data analysis",5.0
12,data analysis,fanduel,"atlanta, ga",2025-04-11,hybrid,"python, sql, excel, tableau, data visualization",3.0
13,data analysis,finthrive,united states,2025-04-15,unknown,"sql, excel, power bi, tableau, data analysis, etl",1.0
14,data analysis,alice + olivia,"new york, ny",2025-04-15,unknown,"sql, excel, statistics, data analysis",5.0
15,data analysis,google,"new york, ny",2025-04-14,unknown,"python, sql, machine learning, statistics, etl...",3.0
16,data analysis,bvlgari,new york city metropolitan area,2025-04-11,unknown,"excel, statistics, data analysis",3.0
19,data analysis,hamilton porter,"new york, ny",2025-04-16,onsite,"python, tableau",5.0
20,data analysis,brooklinen,"brooklyn, ny",2025-04-10,remote,"python, sql, power bi, tableau, r, statistics,...",1.0
21,data analysis,equip,united states,2025-04-16,remote,"sql, tableau",2.0
22,data analysis,toyota north america,"plano, tx",2025-04-15,hybrid,"python, sql, excel, tableau, r, statistics",3.0

In [30]:
# check after replacement 
df['title'].unique()

array(['data analysis', 'data science', 'data engineering',
       'machine learning & AI', 'junior frontend developer'], dtype=object)

In [31]:
# remove this unique row that doesn't related wiht the data jobs 
df = df[df['title']!='junior frontend developer']

In [32]:
from collections import Counter

# Drop rows where skills is None or empty
skills_series = df['skills'].dropna()
skills_list = []

for skills in skills_series:
    skills_split = [skill.strip() for skill in skills.split(',') if skill.strip().lower() != 'none']
    skills_list.extend(skills_split)

# Count the frequency of each skill
skill_counts = Counter(skills_list)

In [33]:
skill_counts

Counter({'python': 174,
         'sql': 173,
         'machine learning': 93,
         'statistics': 82,
         'etl': 75,
         'tableau': 62,
         'r': 59,
         'spark': 57,
         'data analysis': 53,
         'big data': 44,
         'data visualization': 40,
         'power bi': 33,
         'excel': 29,
         'hadoop': 22,
         'deep learning': 19,
         'tensorflow': 18,
         'scikit-learn': 13,
         'pandas': 11,
         'numpy': 9,
         'keras': 8,
         'data wrangling': 5,
         'matplotlib': 3,
         'plotly': 1,
         'seaborn': 1})

In [34]:
df.to_csv('cleaned_job.csv', index=False)